Revit 2027 API
ReferencePlane.Direction Property
 The direction of the reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Direction { get; set; }
Public Property Direction As XYZ
	Get
	Set
public:
property XYZ^ Direction {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Direction : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: newDir has zero length.
Remarks
 When setting this property, an exception will be thrown if the direction vector is not perpendicular to the normal vector.
See Also
Reference
ReferencePlane Class
Autodesk.Revit.DB Namespace